app/controllers/books_controller.rb

INSERT INTO "books" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "a"], ["description", "a"], ["created_at", "2015-06-09 03:42:05.644789"], ["updated_at", "2015-06-09 03:42:05.644789"]]
---
	def create
		@book = Book.new(book_params)


		if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "books" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["name", "Reality is Broken"], ["description", "Jane"], ["updated_at", "2015-06-10 08:21:33.135715"], ["id", 1]]
---
	def update
		@book = Book.find(params[:id])

		if @book.update(book_params)